# -*- coding: utf-8 -*-

POPULATION_SIZE = 5  # количество геномов (рекомендуется 10) (было в оригинале 10)
MUTA_RATE = 10  # вероятность мутации (рекомендуется 0.3) (было в оригинале 20)
ROTATIONS = 4  # выбор вращения, 1: нет вращения
# Единица MM (мм)
SPACING = 6  # графический интервал между контурами
RESULT_ROTATION_ANGLE = 90  # Повернуть весь получившийся результат на 90, 180, 270
RESULT_OFFSET_X = 1500.00  # Если RESULT_ROTATION_ANGLE = 0, то эти значения не учитываются
RESULT_OFFSET_Y = 0.0

# разные размеры рабочей области
BIN_HEIGHT = 1500
BIN_WIDTH = 2500
BIN_NORMAL = [[0, 0], [0, BIN_HEIGHT], [BIN_WIDTH, BIN_HEIGHT], [BIN_WIDTH, 0]]  # области
BIN_CUT_BIG = [[0, 0], [0, 1570], [2500, 1570], [2500, 0]]  # Размер области для резки 1
BIN_CUT_SMALL = [[0, 0], [0, 1200], [1500, 1200], [1500, 0]]  # Размер области для резки 2



# Коэффициент масштабирования контуров для объекта SPLINE
CONTOUR_SCALING = 10  # установите 1, если не надо масштабировать
SPLIT_SPLINES = False  # когда в файле несколько объектов SPLINE (читать как один контур или несколько)
SIMPLIFYING_POLYGONS = True  # упрощать полигоны до минимального количенства точек для увеличения быстродействия
                             # В результате все равно будут исходные точки