# -*- coding: utf-8 -*-

POPULATION_SIZE = 5  # количество геномов (рекомендуется 10)
MUTA_RATE = 0.3  # вероятность мутации (рекомендуется 0.3)
ROTATIONS = 4  # выбор вращения, 1: нет вращения
# Единица MM (мм)
SPACING = 5  # графический интервал между контурами
RESULT_ROTATION_ANGLE = 0  # Повернуть получившийся результат на 90, 180, 270

# разные размеры рабочей области
BIN_HEIGHT = 2500
BIN_WIDTH = 1400
BIN_NORMAL = [[0, 0], [0, BIN_HEIGHT], [BIN_WIDTH, BIN_HEIGHT], [BIN_WIDTH, 0]]  # области
BIN_CUT_BIG = [[0, 0], [0, 1570], [2500, 1570], [2500, 0]]  # Размер области для резки 1
BIN_CUT_SMALL = [[0, 0], [0, 1200], [1500, 1200], [1500, 0]]  # Размер области для резки 2



# Коэффициент масштабирования контуров для объекта SPLINE
CONTOUR_SCALING = 9.6 #9.5  # установите 1, если не надо масштабировать
SPLIT_SPLINES = False  # когда в файле несколько объектов SPLINE (читать как один контур или несколько)
SIMPLIFYING_POLYGONS = True  # упрощать полигоны до минимального количенства точек для увеличения быстродействия