# -*- coding: utf-8 -*-

POPULATION_SIZE = 10  # количество геномов
MUTA_RATE = 0.3       # вероятность мутации
ROTATIONS = 4    # выбор вращения, 1: нет вращения
# Единица MM (мм)
SPACING = 5    # графический интервал
# разные размеры ткани
BIN_HEIGHT = 1500
BIN_WIDTH = 2500
BIN_NORMAL = [[0, 0], [0, BIN_HEIGHT], [BIN_WIDTH, BIN_HEIGHT], [BIN_WIDTH, 0]]        # 一ткань бесконечно длинная
BIN_CUT_BIG = [[0, 0], [0, 1570], [2500, 1570], [2500, 0]]       # Размер машины для резки 1
BIN_CUT_SMALL = [[0, 0], [0, 1200], [1500, 1200], [1500, 0]]     # # Размер машины для резки 2

# Коэффициент масштабирования контуров для объекта SPLINE
COUNTOUR_SCALING = 9

# Увеличить целевую функцию центра тяжести
# оптимизация